//碼頭姑娘(Lady of the Pier) 譜來源:
//http://thaleschou.pixnet.net/blog/post/46548300-%E9%82%84%E9%A1%98%E6%8F%92%E6%9B%B2%EF%BC%9A%E7%A2%BC%E9%A0%AD%E5%A7%91%E5%A8%98----%E4%B8%8D%E5%B0%88%E6%A5%AD%E5%96%AE%E9%9F%B3%E7%B0%A1%E8%AD%9C
/*音符對應轉換表
  Do, Re, Mi, Fa, So, La, Si
  C,  D,  E,  F,  G,  A,  B
  1,  2,  3,  4,  5,  6,  7
*/
/*$PS: 在Arduino，音符(英文字母)後面的數字是指升降key
  如:C4 指的是 標準Do 的降一個八度音
  #標準Do指的是C5
  所以C6 就是 標準Do 的高一個八度音
*/
//------------------以下是歌曲的音符及節奏---------------------
int tune[] =
{ //整首歌的音符
  //P前奏
  3,2,3,5,2,3,2,3,5,      3,2,3,5,6,5,4,3,4,5,
  4,3,4,3,5,5,4,3,4,5,    3,2,3,6,5,6,3,2,3,6,7,1,5,
  //A
  6,5,5,5,3,5,    3,5,2,3,1,    3,5,5,3,5,    3,2,2,1,2,
  6,5,5,5,3,5,    3,1,1,5,6,    1,6,1,6,1,    5,3,5,3,
  //B
  3,2,3,3,5,3,2,3,3,    2,3,5,3,2,1,
  3,2,3,5,    3,2,3,3,    2,3,3,1,1,5,
  3,2,3,5,    3,2,3,3,    2,3,5,3,2,1,
  3,2,3,5,    5,5,3,      2,3,3,1,1,2,
  //Q
  3,2,3,5,    3,2,3,3,    2,6,
  3,2,3,5,    3,2,3,3,    2,7,1,2,
  //R
  3,2,3,5,2,1,7,6,5,6,3,2,5,    5,7,3,5,
  //C
  2,1,2,2,1,2,2,7,1
  //註:整首歌的repeat段: P AB Q ABB R C
  
};//這部分就是整首曲子的音符部分，用了一個序列定義為tune，整數
/*
char duration[] =
{ //整首歌的節奏
  
};//這部分是整首曲子的接拍部分，也定義個序列duration，
//浮點（陣列的個數和前面音符的個數是一樣的，一一對應麼）
*/
